Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.0.45/edc/PIC32MK1024MCF064.PIC
      <edc:SFRDef edc:_addr="0x1F810030" edc:_begin="0x0" edc:_end="0x940" edc:_modsrc="DOS-02481_WACJ_MC_int_evic_v3.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="IPTMR" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="IPTMR" edc:nzwidth="32" edc:por="00000000000000000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="IPTMR" edc:desc="" edc:mask="0xffffffff" edc:name="IPTMR" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F810040" edc:_begin="0x0" edc:_end="0x940" edc:_modsrc="DOS-02481_WACJ_MC_int_evic_v3.Module" edc:_refcount="1" edc:access="nn--nnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="IFS0" edc:desc="" edc:impl="0xcfffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00--0000000000000000000000000000" edc:name="IFS0" edc:nzwidth="32" edc:por="00--0000000000000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CTIF" edc:desc="" edc:mask="0x1" edc:name="CTIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CS0IF" edc:desc="" edc:mask="0x1" edc:name="CS0IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CS1IF" edc:desc="" edc:mask="0x1" edc:name="CS1IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="INT0IF" edc:desc="" edc:mask="0x1" edc:name="INT0IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="T1IF" edc:desc="" edc:mask="0x1" edc:name="T1IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="IC1EIF" edc:desc="" edc:mask="0x1" edc:name="IC1EIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="IC1IF" edc:desc="" edc:mask="0x1" edc:name="IC1IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="OC1IF" edc:desc="" edc:mask="0x1" edc:name="OC1IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="INT1IF" edc:desc="" edc:mask="0x1" edc:name="INT1IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="T2IF" edc:desc="" edc:mask="0x1" edc:name="T2IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="IC2EIF" edc:desc="" edc:mask="0x1" edc:name="IC2EIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="IC2IF" edc:desc="" edc:mask="0x1" edc:name="IC2IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="OC2IF" edc:desc="" edc:mask="0x1" edc:name="OC2IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="INT2IF" edc:desc="" edc:mask="0x1" edc:name="INT2IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="T3IF" edc:desc="" edc:mask="0x1" edc:name="T3IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="IC3EIF" edc:desc="" edc:mask="0x1" edc:name="IC3EIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="IC3IF" edc:desc="" edc:mask="0x1" edc:name="IC3IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="OC3IF" edc:desc="" edc:mask="0x1" edc:name="OC3IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="INT3IF" edc:desc="" edc:mask="0x1" edc:name="INT3IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="T4IF" edc:desc="" edc:mask="0x1" edc:name="T4IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="IC4EIF" edc:desc="" edc:mask="0x1" edc:name="IC4EIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="IC4IF" edc:desc="" edc:mask="0x1" edc:name="IC4IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="OC4IF" edc:desc="" edc:mask="0x1" edc:name="OC4IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="INT4IF" edc:desc="" edc:mask="0x1" edc:name="INT4IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="T5IF" edc:desc="" edc:mask="0x1" edc:name="T5IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="IC5EIF" edc:desc="" edc:mask="0x1" edc:name="IC5EIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="IC5IF" edc:desc="" edc:mask="0x1" edc:name="IC5IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="OC5IF" edc:desc="" edc:mask="0x1" edc:name="OC5IF" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="2"/>
            <edc:SFRFieldDef edc:cname="RTCCIF" edc:desc="" edc:mask="0x1" edc:name="RTCCIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="FCEIF" edc:desc="" edc:mask="0x1" edc:name="FCEIF" edc:nzwidth="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0xffffffff" edc:name="w" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F810050" edc:_begin="0x0" edc:_end="0x940" edc:_modsrc="DOS-02481_WACJ_MC_int_evic_v3.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="IFS1" edc:desc="" edc:impl="0xffffdfff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="IFS1" edc:nzwidth="32" edc:por="00000000000000000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CMP1IF" edc:desc="" edc:mask="0x1" edc:name="CMP1IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CMP2IF" edc:desc="" edc:mask="0x1" edc:name="CMP2IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="USB1IF" edc:desc="" edc:mask="0x1" edc:name="USB1IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SPI1EIF" edc:desc="" edc:mask="0x1" edc:name="SPI1EIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SPI1RXIF" edc:desc="" edc:mask="0x1" edc:name="SPI1RXIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SPI1TXIF" edc:desc="" edc:mask="0x1" edc:name="SPI1TXIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="U1EIF" edc:desc="" edc:mask="0x1" edc:name="U1EIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="U1RXIF" edc:desc="" edc:mask="0x1" edc:name="U1RXIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="U1TXIF" edc:desc="" edc:mask="0x1" edc:name="U1TXIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="I2C1BIF" edc:desc="" edc:mask="0x1" edc:name="I2C1BIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="I2C1SIF" edc:desc="" edc:mask="0x1" edc:name="I2C1SIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="I2C1MIF" edc:desc="" edc:mask="0x1" edc:name="I2C1MIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CNAIF" edc:desc="" edc:mask="0x1" edc:name="CNAIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CNBIF" edc:desc="" edc:mask="0x1" edc:name="CNBIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CNCIF" edc:desc="" edc:mask="0x1" edc:name="CNCIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CNDIF" edc:desc="" edc:mask="0x1" edc:name="CNDIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CNEIF" edc:desc="" edc:mask="0x1" edc:name="CNEIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CNFIF" edc:desc="" edc:mask="0x1" edc:name="CNFIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CNGIF" edc:desc="" edc:mask="0x1" edc:name="CNGIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="PMPIF" edc:desc="" edc:mask="0x1" edc:name="PMPIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="PMPEIF" edc:mask="0x1" edc:name="PMPEIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SPI2EIF" edc:desc="" edc:mask="0x1" edc:name="SPI2EIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SPI2RXIF" edc:desc="" edc:mask="0x1" edc:name="SPI2RXIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SPI2TXIF" edc:desc="" edc:mask="0x1" edc:name="SPI2TXIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="U2EIF" edc:desc="" edc:mask="0x1" edc:name="U2EIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="U2RXIF" edc:desc="" edc:mask="0x1" edc:name="U2RXIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="U2TXIF" edc:desc="" edc:mask="0x1" edc:name="U2TXIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="I2C2BIF" edc:desc="" edc:mask="0x1" edc:name="I2C2BIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="I2C2SIF" edc:desc="" edc:mask="0x1" edc:name="I2C2SIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="I2C2MIF" edc:desc="" edc:mask="0x1" edc:name="I2C2MIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="U3EIF" edc:desc="" edc:mask="0x1" edc:name="U3EIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="U3RXIF" edc:desc="" edc:mask="0x1" edc:name="U3RXIF" edc:nzwidth="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0xffffffff" edc:name="w" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F810060" edc:_begin="0x0" edc:_end="0x940" edc:_modsrc="DOS-02481_WACJ_MC_int_evic_v3.Module" edc:_refcount="1" edc:access="nn-nnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="IFS2" edc:desc="" edc:impl="0xdfffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0u-00000000000000000000000000000" edc:name="IFS2" edc:nzwidth="32" edc:por="0x-00000000000000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="U3TXIF" edc:desc="" edc:mask="0x1" edc:name="U3TXIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="U4EIF" edc:desc="" edc:mask="0x1" edc:name="U4EIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="U4RXIF" edc:desc="" edc:mask="0x1" edc:name="U4RXIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="U4TXIF" edc:desc="" edc:mask="0x1" edc:name="U4TXIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="U5EIF" edc:desc="" edc:mask="0x1" edc:name="U5EIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="U5RXIF" edc:desc="" edc:mask="0x1" edc:name="U5RXIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="U5TXIF" edc:desc="" edc:mask="0x1" edc:name="U5TXIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CTMUIF" edc:desc="" edc:mask="0x1" edc:name="CTMUIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="DMA0IF" edc:desc="" edc:mask="0x1" edc:name="DMA0IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="DMA1IF" edc:desc="" edc:mask="0x1" edc:name="DMA1IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="DMA2IF" edc:desc="" edc:mask="0x1" edc:name="DMA2IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="DMA3IF" edc:desc="" edc:mask="0x1" edc:name="DMA3IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="T6IF" edc:desc="" edc:mask="0x1" edc:name="T6IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="IC6EIF" edc:desc="" edc:mask="0x1" edc:name="IC6EIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="IC6IF" edc:desc="" edc:mask="0x1" edc:name="IC6IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="OC6IF" edc:desc="" edc:mask="0x1" edc:name="OC6IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="T7IF" edc:desc="" edc:mask="0x1" edc:name="T7IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="IC7EIF" edc:desc="" edc:mask="0x1" edc:name="IC7EIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="IC7IF" edc:desc="" edc:mask="0x1" edc:name="IC7IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="OC7IF" edc:desc="" edc:mask="0x1" edc:name="OC7IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="T8IF" edc:desc="" edc:mask="0x1" edc:name="T8IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="IC8EIF" edc:desc="" edc:mask="0x1" edc:name="IC8EIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="IC8IF" edc:desc="" edc:mask="0x1" edc:name="IC8IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="OC8IF" edc:desc="" edc:mask="0x1" edc:name="OC8IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="T9IF" edc:desc="" edc:mask="0x1" edc:name="T9IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="IC9EIF" edc:desc="" edc:mask="0x1" edc:name="IC9EIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="IC9IF" edc:desc="" edc:mask="0x1" edc:name="IC9IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="OC9IF" edc:desc="" edc:mask="0x1" edc:name="OC9IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="AD1IF" edc:desc="" edc:mask="0x1" edc:name="AD1IF" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="AD1DC1IF" edc:mask="0x1" edc:name="AD1DC1IF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AD1DC2IF" edc:desc="" edc:mask="0x1" edc:name="AD1DC2IF" edc:nzwidth="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0xffffffff" edc:name="w" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F810070" edc:_begin="0x0" edc:_end="0x940" edc:_modsrc="DOS-02481_WACJ_MC_int_evic_v3.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="IFS3" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000000u0000u0000000" edc:name="IFS3" edc:nzwidth="32" edc:por="0000000000000000000x0000x0000000" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="AD1DF1IF" edc:desc="" edc:mask="0x1" edc:name="AD1DF1IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="AD1DF2IF" edc:desc="" edc:mask="0x1" edc:name="AD1DF2IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="AD1DF3IF" edc:desc="" edc:mask="0x1" edc:name="AD1DF3IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="AD1DF4IF" edc:desc="" edc:mask="0x1" edc:name="AD1DF4IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="AD1FIIF" edc:desc="" edc:mask="0x1" edc:name="AD1FIIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="AD1EOSIF" edc:desc="" edc:mask="0x1" edc:name="AD1EOSIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="AD1ARIF" edc:desc="" edc:mask="0x1" edc:name="AD1ARIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="AD1RSIF" edc:mask="0x1" edc:name="AD1RSIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AD1FCBTIF" edc:desc="" edc:mask="0x1" edc:name="AD1FCBTIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="AD1GIF" edc:desc="" edc:mask="0x1" edc:name="AD1GIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="AD1D0IF" edc:desc="" edc:mask="0x1" edc:name="AD1D0IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="AD1D1IF" edc:desc="" edc:mask="0x1" edc:name="AD1D1IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="AD1D2IF" edc:desc="" edc:mask="0x1" edc:name="AD1D2IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="AD1D3IF" edc:desc="" edc:mask="0x1" edc:name="AD1D3IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="AD1D4IF" edc:desc="" edc:mask="0x1" edc:name="AD1D4IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="AD1D5IF" edc:desc="" edc:mask="0x1" edc:name="AD1D5IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="AD1D6IF" edc:desc="" edc:mask="0x1" edc:name="AD1D6IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="AD1D7IF" edc:desc="" edc:mask="0x1" edc:name="AD1D7IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="AD1D8IF" edc:desc="" edc:mask="0x1" edc:name="AD1D8IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="AD1D9IF" edc:desc="" edc:mask="0x1" edc:name="AD1D9IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="AD1D10IF" edc:desc="" edc:mask="0x1" edc:name="AD1D10IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="AD1D11IF" edc:desc="" edc:mask="0x1" edc:name="AD1D11IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="AD1D12IF" edc:desc="" edc:mask="0x1" edc:name="AD1D12IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="AD1D13IF" edc:desc="" edc:mask="0x1" edc:name="AD1D13IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="AD1D14IF" edc:desc="" edc:mask="0x1" edc:name="AD1D14IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="AD1D15IF" edc:desc="" edc:mask="0x1" edc:name="AD1D15IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="AD1D16IF" edc:desc="" edc:mask="0x1" edc:name="AD1D16IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="AD1D17IF" edc:desc="" edc:mask="0x1" edc:name="AD1D17IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="AD1D18IF" edc:desc="" edc:mask="0x1" edc:name="AD1D18IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="AD1D19IF" edc:desc="" edc:mask="0x1" edc:name="AD1D19IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="AD1D20IF" edc:desc="" edc:mask="0x1" edc:name="AD1D20IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="AD1D21IF" edc:desc="" edc:mask="0x1" edc:name="AD1D21IF" edc:nzwidth="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0xffffffff" edc:name="w" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F810080" edc:_begin="0x0" edc:_end="0x940" edc:_modsrc="DOS-02481_WACJ_MC_int_evic_v3.Module" edc:_refcount="1" edc:access="nnnnnnnnn---nnnnnnnnn-----nnnnnn" edc:cname="IFS4" edc:desc="" edc:impl="0xff8ff83f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="000000000---000000000-----000000" edc:name="IFS4" edc:nzwidth="32" edc:por="000000000---000000000-----000000" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="AD1D22IF" edc:desc="" edc:mask="0x1" edc:name="AD1D22IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="AD1D23IF" edc:desc="" edc:mask="0x1" edc:name="AD1D23IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="AD1D24IF" edc:desc="" edc:mask="0x1" edc:name="AD1D24IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="AD1D25IF" edc:desc="" edc:mask="0x1" edc:name="AD1D25IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="AD1D26IF" edc:desc="" edc:mask="0x1" edc:name="AD1D21IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="AD1D27IF" edc:desc="" edc:mask="0x1" edc:name="AD1D27IF" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="5"/>
            <edc:SFRFieldDef edc:cname="AD1D33IF" edc:desc="" edc:mask="0x1" edc:name="AD1D33IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="AD1D34IF" edc:desc="" edc:mask="0x1" edc:name="AD1D34IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="AD1D35IF" edc:desc="" edc:mask="0x1" edc:name="AD1D35IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="AD1D36IF" edc:desc="" edc:mask="0x1" edc:name="AD1D36IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="AD1D37IF" edc:desc="" edc:mask="0x1" edc:name="AD1D37IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="AD1D38IF" edc:desc="" edc:mask="0x1" edc:name="AD1D38IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="AD1D39IF" edc:desc="" edc:mask="0x1" edc:name="AD1D39IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="AD1D40IF" edc:desc="" edc:mask="0x1" edc:name="AD1D40IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="AD1D41IF" edc:desc="" edc:mask="0x1" edc:name="AD1D41IF" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="AD1D45IF" edc:desc="" edc:mask="0x1" edc:name="AD1D45IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="AD1D46IF" edc:desc="" edc:mask="0x1" edc:name="AD1D46IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="AD1D47IF" edc:desc="" edc:mask="0x1" edc:name="AD1D47IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="AD1D48IF" edc:desc="" edc:mask="0x1" edc:name="AD1D48IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="AD1D49IF" edc:desc="" edc:mask="0x1" edc:name="AD1D49IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="AD1D50IF" edc:desc="" edc:mask="0x1" edc:name="AD1D50IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="AD1D51IF" edc:desc="" edc:mask="0x1" edc:name="AD1D51IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="AD1D52IF" edc:desc="" edc:mask="0x1" edc:name="AD1D52IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="AD1D53IF" edc:desc="" edc:mask="0x1" edc:name="AD1D53IF" edc:nzwidth="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0xffffffff" edc:name="w" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
