Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.0.45/edc/PIC32MK1024MCF064.PIC
      <edc:SFRDef edc:_addr="0x1F810120" edc:_begin="0x0" edc:_end="0x940" edc:_modsrc="DOS-02481_WACJ_MC_int_evic_v3.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnn-n" edc:cname="IEC6" edc:desc="" edc:impl="0xfffffffd" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu00uu0000000u000000000u-u" edc:name="IEC6" edc:nzwidth="32" edc:por="xxxxxxxx00xx0000000x000000000x-x" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="QEI6IE" edc:mask="0x1" edc:name="QEI6IE" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="I2C4BIE" edc:mask="0x1" edc:name="I2C4BIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="I2C4SIE" edc:mask="0x1" edc:name="I2C4SIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="I2C4MIE" edc:mask="0x1" edc:name="I2C4MIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IC10EIE" edc:mask="0x1" edc:name="IC10EIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IC10IE" edc:mask="0x1" edc:name="IC10IE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OC10IE" edc:mask="0x1" edc:name="OC10IE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IC11EIE" edc:mask="0x1" edc:name="IC11EIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IC11IE" edc:mask="0x1" edc:name="IC11IE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OC11IE" edc:mask="0x1" edc:name="OC11IE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IC12EIE" edc:mask="0x1" edc:name="IC12EIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IC12IE" edc:mask="0x1" edc:name="IC12IE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OC12IE" edc:mask="0x1" edc:name="OC12IE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IC13EIE" edc:mask="0x1" edc:name="IC13EIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IC13IE" edc:mask="0x1" edc:name="IC13IE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OC13IE" edc:mask="0x1" edc:name="OC13IE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IC14EIE" edc:mask="0x1" edc:name="IC14EIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IC14IE" edc:mask="0x1" edc:name="IC14IE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OC14IE" edc:mask="0x1" edc:name="OC14IE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IC15EIE" edc:mask="0x1" edc:name="IC15EIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IC15IE" edc:mask="0x1" edc:name="IC15IE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OC15IE" edc:mask="0x1" edc:name="OC15IE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IC16EIE" edc:mask="0x1" edc:name="IC16EIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IC16IE" edc:mask="0x1" edc:name="IC16IE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OC16IE" edc:mask="0x1" edc:name="OC16IE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SPI3EIE" edc:mask="0x1" edc:name="SPI3EIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SPI3RXIE" edc:mask="0x1" edc:name="SPI3RXIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SPI3TXIE" edc:mask="0x1" edc:name="SPI3TXIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SPI4EIE" edc:mask="0x1" edc:name="SPI4EIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SPI4RXIE" edc:mask="0x1" edc:name="SPI4RXIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SPI4TXIE" edc:mask="0x1" edc:name="SPI4TXIE" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0xffffffff" edc:name="w" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F810130" edc:_begin="0x0" edc:_end="0x940" edc:_modsrc="DOS-02481_WACJ_MC_int_evic_v3.Module" edc:_refcount="1" edc:access="-n-------nnn-------nnnnnnnnnnnnn" edc:cname="IEC7" edc:desc="" edc:impl="0x40701fff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-u-------uuu-------uuuuuuuuuuuuu" edc:name="IEC7" edc:nzwidth="32" edc:por="-x-------xxx-------xxxxxxxxxxxxx" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SPI5EIE" edc:mask="0x1" edc:name="SPI5EIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SPI5RXIE" edc:mask="0x1" edc:name="SPI5RXIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SPI5TXIE" edc:mask="0x1" edc:name="SPI5TXIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SPI6EIE" edc:mask="0x1" edc:name="SPI6EIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SPI6RXIE" edc:mask="0x1" edc:name="SPI6RXIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SPI6TXIE" edc:mask="0x1" edc:name="SPI6TXIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SBIE" edc:mask="0x1" edc:name="SBIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PTGSTEPIE" edc:mask="0x1" edc:name="PTGSTEPIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PTGWDTIE" edc:mask="0x1" edc:name="PTGWDTIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PTG0TR0" edc:mask="0x1" edc:name="PTG0TR0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PTG0TR1" edc:mask="0x1" edc:name="PTG0TR1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PTG0TR2" edc:mask="0x1" edc:name="PTG0TR2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PTG0TR3" edc:mask="0x1" edc:name="PTG0TR3" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="PWM7IE" edc:mask="0x1" edc:name="PWM7IE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PWM8IE" edc:mask="0x1" edc:name="PWM8IE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PWM9IE" edc:mask="0x1" edc:name="PWM9IE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PWM10IE" edc:mask="0x1" edc:name="PWM10IE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PWM11IE" edc:mask="0x1" edc:name="PWM11IE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PWM12IE" edc:mask="0x1" edc:name="PWM12IE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USB2IE" edc:mask="0x1" edc:name="USB2IE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AD1DC3IE" edc:mask="0x1" edc:name="AD1DC3IE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AD1DC4IE" edc:mask="0x1" edc:name="AD1DC4IE" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CPCIE" edc:mask="0x1" edc:name="CPCIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CFDCIE" edc:mask="0x1" edc:name="CFDCIE" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0xffffffff" edc:name="w" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
