Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.0.45/edc/PIC32MK1024MCF064.PIC
      <edc:SFRDef edc:_addr="0x1F8104B0" edc:_begin="0x0" edc:_end="0x940" edc:_modsrc="DOS-02481_WACJ_MC_int_evic_v3.Module" edc:_refcount="1" edc:access="---nnnnn---nnnnn---nnnnn---nnnnn" edc:cname="IPC55" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000---00000---00000---00000" edc:name="IPC55" edc:nzwidth="32" edc:por="---00000---00000---00000---00000" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SPI3TXIS" edc:desc="" edc:mask="0x3" edc:name="SPI3TXIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="SPI3TXIP" edc:desc="" edc:mask="0x7" edc:name="SPI3TXIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="SPI4EIS" edc:desc="" edc:mask="0x3" edc:name="SPI4EIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="SPI4EIP" edc:desc="" edc:mask="0x7" edc:name="SPI4EIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="SPI4RXIS" edc:desc="" edc:mask="0x3" edc:name="SPI4RXIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="SPI4RXIP" edc:desc="" edc:mask="0x7" edc:name="SPI4RXIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="SPI4TXIS" edc:desc="" edc:mask="0x3" edc:name="SPI4TXIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="SPI4TXIP" edc:desc="" edc:mask="0x7" edc:name="SPI4TXIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0xffffffff" edc:name="w" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8104C0" edc:_begin="0x0" edc:_end="0x940" edc:_modsrc="DOS-02481_WACJ_MC_int_evic_v3.Module" edc:_refcount="1" edc:access="---nnnnn---nnnnn---nnnnn---nnnnn" edc:cname="IPC56" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000---00000---00000---00000" edc:name="IPC56" edc:nzwidth="32" edc:por="---00000---00000---00000---00000" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SPI5EIS" edc:desc="" edc:mask="0x3" edc:name="SPI5EIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="SPI5EIP" edc:desc="" edc:mask="0x7" edc:name="SPI5EIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="SPI5RXIS" edc:desc="" edc:mask="0x3" edc:name="SPI5RXIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="SPI5RXIP" edc:desc="" edc:mask="0x7" edc:name="SPI5RXIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="SPI5TXIS" edc:desc="" edc:mask="0x3" edc:name="SPI5TXIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="SPI5TXIP" edc:desc="" edc:mask="0x7" edc:name="SPI5TXIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="SPI6EIS" edc:desc="" edc:mask="0x3" edc:name="SPI6EIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="SPI6EIP" edc:desc="" edc:mask="0x7" edc:name="SPI6EIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0xffffffff" edc:name="w" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8104D0" edc:_begin="0x0" edc:_end="0x940" edc:_modsrc="DOS-02481_WACJ_MC_int_evic_v3.Module" edc:_refcount="1" edc:access="---nnnnn---nnnnn---nnnnn---nnnnn" edc:cname="IPC57" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu---00000---00000---00000" edc:name="IPC57" edc:nzwidth="32" edc:por="---xxxxx---00000---00000---00000" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SPI6RXIS" edc:desc="" edc:mask="0x3" edc:name="SPI6RXIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="SPI6RXIP" edc:desc="" edc:mask="0x7" edc:name="SPI6RXIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="SPI6TXIS" edc:desc="" edc:mask="0x3" edc:name="SPI6TXIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="SPI6TXIP" edc:desc="" edc:mask="0x7" edc:name="SPI6TXIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="SBIS" edc:desc="" edc:mask="0x3" edc:name="SBIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="SBIP" edc:desc="" edc:mask="0x7" edc:name="SBIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="PTGSTEPIS" edc:mask="0x3" edc:name="PTGSTEPIS" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="PTGSTEPIP" edc:mask="0x7" edc:name="PTGSTEPIP" edc:nzwidth="0x3"/>
            <edc:AdjustPoint edc:offset="0x3"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0xffffffff" edc:name="w" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8104E0" edc:_begin="0x0" edc:_end="0x940" edc:_modsrc="DOS-02481_WACJ_MC_int_evic_v3.Module" edc:_refcount="1" edc:access="---nnnnn---nnnnn---nnnnn---nnnnn" edc:cname="IPC58" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu---uuuuu---uuuuu---uuuuu" edc:name="IPC58" edc:nzwidth="32" edc:por="---xxxxx---xxxxx---xxxxx---xxxxx" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="PTGWDTIS" edc:mask="0x3" edc:name="PTGWDTIS" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="PTGWDTIP" edc:mask="0x7" edc:name="PTGWDTIP" edc:nzwidth="0x3"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="PTG0TR0IS" edc:mask="0x3" edc:name="PTG0TR0IS" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="PTG0TR0IP" edc:mask="0x7" edc:name="PTG0TR0IP" edc:nzwidth="0x3"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="PTG0TR1IS" edc:mask="0x3" edc:name="PTG0TR1IS" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="PTG0TR1IP" edc:mask="0x7" edc:name="PTG0TR1IP" edc:nzwidth="0x3"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="PTG0TR2IS" edc:mask="0x3" edc:name="PTG0TR2IS" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="PTG0TR2IP" edc:mask="0x7" edc:name="PTG0TR2IP" edc:nzwidth="0x3"/>
            <edc:AdjustPoint edc:offset="0x3"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0xffffffff" edc:name="w" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8104F0" edc:_begin="0x0" edc:_end="0x940" edc:_modsrc="DOS-02481_WACJ_MC_int_evic_v3.Module" edc:_refcount="1" edc:access="---nnnnn---nnnnn-----------nnnnn" edc:cname="IPC59" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu---uuuuu-----------uuuuu" edc:name="IPC59" edc:nzwidth="32" edc:por="---xxxxx---xxxxx-----------xxxxx" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="PTG0TR3IS" edc:mask="0x3" edc:name="PTG0TR3IS" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="PTG0TR3IP" edc:mask="0x7" edc:name="PTG0TR3IP" edc:nzwidth="0x3"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:AdjustPoint edc:offset="8"/>
            <edc:SFRFieldDef edc:cname="PWM7IS" edc:mask="0x3" edc:name="PWM7IS" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="PWM7IP" edc:mask="0x7" edc:name="PWM7IP" edc:nzwidth="0x3"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="PWM8IS" edc:mask="0x3" edc:name="PWM8IS" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="PWM8IP" edc:mask="0x7" edc:name="PWM8IP" edc:nzwidth="0x3"/>
            <edc:AdjustPoint edc:offset="0x3"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0xffffffff" edc:name="w" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F810500" edc:_begin="0x0" edc:_end="0x940" edc:_modsrc="DOS-02481_WACJ_MC_int_evic_v3.Module" edc:_refcount="1" edc:access="---nnnnn---nnnnn---nnnnn---nnnnn" edc:cname="IPC60" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu---uuuuu---uuuuu---uuuuu" edc:name="IPC60" edc:nzwidth="32" edc:por="---xxxxx---xxxxx---xxxxx---xxxxx" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="PWM9IS" edc:mask="0x3" edc:name="PWM9IS" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="PWM9IP" edc:mask="0x7" edc:name="PWM9IP" edc:nzwidth="0x3"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="PWM10IS" edc:mask="0x3" edc:name="PWM10IS" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="PWM10IP" edc:mask="0x7" edc:name="PWM10IP" edc:nzwidth="0x3"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="PWM11IS" edc:mask="0x3" edc:name="PWM11IS" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="PWM11IP" edc:mask="0x7" edc:name="PWM11IP" edc:nzwidth="0x3"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="PWM12IS" edc:mask="0x3" edc:name="PWM12IS" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="PWM12IP" edc:mask="0x7" edc:name="PWM12IP" edc:nzwidth="0x3"/>
            <edc:AdjustPoint edc:offset="0x3"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0xffffffff" edc:name="w" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F810510" edc:_begin="0x0" edc:_end="0x940" edc:_modsrc="DOS-02481_WACJ_MC_int_evic_v3.Module" edc:_refcount="1" edc:access="-----------nnnnn---nnnnn---nnnnn" edc:cname="IPC61" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----------00000---00000---00000" edc:name="IPC61" edc:nzwidth="32" edc:por="-----------00000---00000---00000" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="USB2IS" edc:desc="" edc:mask="0x3" edc:name="USB2IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="USB2IP" edc:desc="" edc:mask="0x7" edc:name="USB2IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="AD1DC3IS" edc:desc="" edc:mask="0x3" edc:name="AD1DC3IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="AD1DC3IP" edc:desc="" edc:mask="0x7" edc:name="AD1DC3IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="AD1DC4IS" edc:desc="" edc:mask="0x3" edc:name="AD1DC4IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="AD1DC4IP" edc:desc="" edc:mask="0x7" edc:name="AD1DC4IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:AdjustPoint edc:offset="8"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0xffffffff" edc:name="w" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F810520" edc:_begin="0x0" edc:_end="0x940" edc:_modsrc="DOS-02481_WACJ_MC_int_evic_v3.Module" edc:_refcount="1" edc:access="--------------------------------" edc:cname="IPC62" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------------------------------" edc:name="IPC62" edc:nzwidth="32" edc:por="--------------------------------" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="8"/>
            <edc:AdjustPoint edc:offset="8"/>
            <edc:AdjustPoint edc:offset="8"/>
            <edc:AdjustPoint edc:offset="8"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0xffffffff" edc:name="w" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
