Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.0.45/edc/PIC32MK1024MCF064.PIC
      <edc:SFRDef edc:_addr="0x1F82A1E0" edc:_begin="0xa0" edc:_end="0x1a0" edc:_modsrc="DOS-01477_pwm_mc_upb_v1.Module" edc:_refcount="3" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="PDC2" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0000000000000000" edc:name="PDC2" edc:nzwidth="32" edc:por="----------------0000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="PDC" edc:mask="0xffff" edc:name="PDC" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F82A1F0" edc:_begin="0xa0" edc:_end="0x1a0" edc:_modsrc="DOS-01477_pwm_mc_upb_v1.Module" edc:_refcount="3" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="SDC2" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0000000000000000" edc:name="SDC2" edc:nzwidth="32" edc:por="----------------0000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SDC" edc:mask="0xffff" edc:name="SDC" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F82A200" edc:_begin="0xa0" edc:_end="0x1a0" edc:_modsrc="DOS-01477_pwm_mc_upb_v1.Module" edc:_refcount="3" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="PHASE2" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0000000000000000" edc:name="PHASE2" edc:nzwidth="32" edc:por="----------------0000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="PHASE" edc:mask="0xffff" edc:name="PHASE" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F82A210" edc:_begin="0xa0" edc:_end="0x1a0" edc:_modsrc="DOS-01477_pwm_mc_upb_v1.Module" edc:_refcount="3" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="DTR2" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0000000000000000" edc:name="DTR2" edc:nzwidth="32" edc:por="----------------0000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DTR" edc:mask="0xffff" edc:name="DTR" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F82A220" edc:_begin="0xa0" edc:_end="0x1a0" edc:_modsrc="DOS-01477_pwm_mc_upb_v1.Module" edc:_refcount="3" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="ALTDTR2" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0000000000000000" edc:name="ALTDTR2" edc:nzwidth="32" edc:por="----------------0000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="ALTDTR" edc:mask="0xffff" edc:name="ALTDTR" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F82A230" edc:_begin="0xa0" edc:_end="0x1a0" edc:_modsrc="DOS-01477_pwm_mc_upb_v1.Module" edc:_refcount="3" edc:access="------------------nnnnnnnnnnnnnn" edc:cname="DTCOMP2" edc:desc="" edc:impl="0x3fff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------------------00000000000000" edc:name="DTCOMP2" edc:nzwidth="32" edc:por="------------------00000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="COMP" edc:mask="0x3fff" edc:name="COMP" edc:nzwidth="0xe"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F82A240" edc:_begin="0xa0" edc:_end="0x1a0" edc:_modsrc="DOS-01477_pwm_mc_upb_v1.Module" edc:_refcount="3" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="TRIG2" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0000000000000000" edc:name="TRIG2" edc:nzwidth="32" edc:por="----------------0000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TRGCMP" edc:mask="0xffff" edc:name="TRGCMP" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F82A250" edc:_begin="0xa0" edc:_end="0x1a0" edc:_modsrc="DOS-01477_pwm_mc_upb_v1.Module" edc:_refcount="3" edc:access="----------------nnnnnnnnnn------" edc:cname="TRGCON2" edc:desc="" edc:impl="0xffc0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0000000000------" edc:name="TRGCON2" edc:nzwidth="32" edc:por="----------------0000000000------" edc:portals="CLR SET INV" ltx:memberofperipheral="">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="STRGIS" edc:mask="0x1" edc:name="STRGIS" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DTM" edc:mask="0x1" edc:name="DTM" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="STRGSEL" edc:mask="0x3" edc:name="STRGSEL" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="TRGSEL" edc:mask="0x3" edc:name="TRGSEL" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="TRGDIV" edc:mask="0xf" edc:name="TRGDIV" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F82A260" edc:_begin="0xa0" edc:_end="0x1a0" edc:_modsrc="DOS-01477_pwm_mc_upb_v1.Module" edc:_refcount="3" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="STRIG2" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0000000000000000" edc:name="STRIG2" edc:nzwidth="32" edc:por="----------------0000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="STRGCMP" edc:mask="0xffff" edc:name="STRGCMP" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F82A270" edc:_begin="0xa0" edc:_end="0x1a0" edc:_modsrc="DOS-01477_pwm_mc_upb_v1.Module" edc:_refcount="3" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="CAP2" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0000000000000000" edc:name="CAP2" edc:nzwidth="32" edc:por="----------------0000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CAP" edc:mask="0xffff" edc:name="CAP" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F82A280" edc:_begin="0xa0" edc:_end="0x1a0" edc:_modsrc="DOS-01477_pwm_mc_upb_v1.Module" edc:_refcount="3" edc:access="----------------nnnnnn----------" edc:cname="LEBCON2" edc:desc="" edc:impl="0xfc00" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------000000----------" edc:name="LEBCON2" edc:nzwidth="32" edc:por="----------------000000----------" edc:portals="CLR SET INV" ltx:memberofperipheral="">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="0xa"/>
            <edc:SFRFieldDef edc:cname="CLLEBEN" edc:mask="0x1" edc:name="CLLEBEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FLTLEBEN" edc:mask="0x1" edc:name="FLTLEBEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PLF" edc:mask="0x1" edc:name="PLF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PLR" edc:mask="0x1" edc:name="PLR" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PHF" edc:mask="0x1" edc:name="PHF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PHR" edc:mask="0x1" edc:name="PHR" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F82A290" edc:_begin="0xa0" edc:_end="0x1a0" edc:_modsrc="DOS-01477_pwm_mc_upb_v1.Module" edc:_refcount="3" edc:access="--------------------nnnnnnnnnnnn" edc:cname="LEBDLY2" edc:desc="" edc:impl="0xfff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------------------000000000000" edc:name="LEBDLY2" edc:nzwidth="32" edc:por="--------------------000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="LEB" edc:mask="0xfff" edc:name="LEB" edc:nzwidth="0xc"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F82A2A0" edc:_begin="0xa0" edc:_end="0x1a0" edc:_modsrc="DOS-01477_pwm_mc_upb_v1.Module" edc:_refcount="3" edc:access="--------------------------nnnnnn" edc:cname="AUXCON2" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------------------------000000" edc:name="AUXCON2" edc:nzwidth="32" edc:por="--------------------------000000" edc:portals="CLR SET INV" ltx:memberofperipheral="">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CHOPLEN" edc:mask="0x1" edc:name="CHOPLEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHOPHEN" edc:mask="0x1" edc:name="CHOPHEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHOPSEL" edc:mask="0xf" edc:name="CHOPSEL" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
